In [1]:
import pandas as pd

## Series: pd.Series(data,index,dtype) ; it is 1D

## DataFrame: pd.DataFrame(data,index,columns,dtype) ; it is 2D

Q. - what is the difference between Series and DataFrame?
Docstring:      DF
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmatic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

## Create a DataFrame using different inputs

In [2]:
#list
pd.DataFrame([10,20,30,40])
# in DF: colums are labelled

    0
0  10
1  20
2  30
3  40

In [3]:
pd.Series([10,20,30,40])
# here we dont have column option

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
# list of list
d = [[1,2,3],[3,4,5]]
pd.DataFrame(d)
# internal list is now a row

   0  1  2
0  1  2  3
1  3  4  5

In [5]:
# using dict
d = {'Name':['Sarang'],'Age':[22],'Salary':[120000],'place':['Sangli']}
# key acts a column label
# and value become a column entry
pd.DataFrame(d)

     Name  Age  Salary   place
0  Sarang   22  120000  Sangli

In [6]:
#add multiple etries in d
d = {'Name':['Sarang','Sharvari','Ankush','Sandeep'],
     'Age':[22,20,23,21],
     'Salary':[120000,56000,70000,50000],
     'place':['Sangli','Pune','Kolhapur','Pune']}
# key acts a column label
# and value become a column entry
pd.DataFrame(d)

       Name  Age  Salary     place
0    Sarang   22  120000    Sangli
1  Sharvari   20   56000      Pune
2    Ankush   23   70000  Kolhapur
3   Sandeep   21   50000      Pune

In [7]:
# using numpy array
# PS: Create a DatafRame with random numbers 4x4
import numpy as np
n = np.random.random((4,4))
pd.DataFrame(n)

          0         1         2         3
0  0.206384  0.782562  0.240705  0.961340
1  0.130959  0.203902  0.000299  0.330564
2  0.568338  0.490726  0.804909  0.771175
3  0.085557  0.334792  0.444732  0.359168

In [8]:
# change index
pd.DataFrame(n,index=[101,102,103,104])

            0         1         2         3
101  0.206384  0.782562  0.240705  0.961340
102  0.130959  0.203902  0.000299  0.330564
103  0.568338  0.490726  0.804909  0.771175
104  0.085557  0.334792  0.444732  0.359168

In [9]:
# change column labels
pd.DataFrame(n,index=[101,102,103,104],columns=['a','b','c','d'])

            a         b         c         d
101  0.206384  0.782562  0.240705  0.961340
102  0.130959  0.203902  0.000299  0.330564
103  0.568338  0.490726  0.804909  0.771175
104  0.085557  0.334792  0.444732  0.359168

In [10]:
# using a series
s = pd.Series([1,2,3,4,5,6,7,8,9,10])
pd.DataFrame(s)

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [11]:
# use multiple Series
s1 = pd.Series([1,2,3,4])
s2 = pd.Series(['A','V','D','C'])
s3 = pd.Series([20,30,40,50])

In [12]:
pd.DataFrame({'val1':s1,'val2':s2,'val3s':s3})

   val1 val2  val3s
0     1    A     20
1     2    V     30
2     3    D     40
3     4    C     50

In [13]:
pd.DataFrame([s1,s2,s3])

    0   1   2   3
0   1   2   3   4
1   A   V   D   C
2  20  30  40  50

In [14]:
pd.DataFrame([s1,s2,s3],index=['a','c','d'])

    0   1   2   3
a   1   2   3   4
c   A   V   D   C
d  20  30  40  50

## read covid_variants.csv dataset

In [17]:
d = pd.read_csv(r'C:\Users\abhis\Downloads\covid-variants.csv')
d

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
0,Angola,2020-07-06,Alpha,0,0.0,3
1,Angola,2020-07-06,B.1.1.277,0,0.0,3
2,Angola,2020-07-06,B.1.1.302,0,0.0,3
3,Angola,2020-07-06,B.1.1.519,0,0.0,3
4,Angola,2020-07-06,B.1.160,0,0.0,3
...,...,...,...,...,...,...
100411,Zimbabwe,2021-11-01,Omicron,0,0.0,6
100412,Zimbabwe,2021-11-01,S:677H.Robin1,0,0.0,6
100413,Zimbabwe,2021-11-01,S:677P.Pelican,0,0.0,6
100414,Zimbabwe,2021-11-01,others,0,0.0,6
100415,Zimbabwe,2021-11-01,non_who,0,0.0,6

In [20]:
# check type
type(d)

pandas.core.frame.DataFrame

In [21]:
# how much data we have???
# rows and columns
d.shape

(100416, 6)

In [23]:
# return/execute the number of rows and columns properly 
print('Total number of rows:',d.shape[0])
print('Total number of columns:',d.shape[1])

Total number of rows: 100416
Total number of columns: 6

## now list out column names

In [24]:
d.columns

Index(['location', 'date', 'variant', 'num_sequences', 'perc_sequences',
       'num_sequences_total'],
      dtype='object')

## check the descriptive statistical summery of data

In [25]:
d.describe()
# describe by default works on numeric columns

       num_sequences  perc_sequences  num_sequences_total
count  100416.000000   100416.000000        100416.000000
mean       72.171676        6.154355          1509.582457
std      1669.262169       21.898989          8445.291772
min         0.000000       -0.010000             1.000000
25%         0.000000        0.000000            12.000000
50%         0.000000        0.000000            59.000000
75%         0.000000        0.000000           394.000000
max    142280.000000      100.000000        146170.000000

## Now check dtype of each column

In [26]:
d.dtypes

location                object
date                    object
variant                 object
num_sequences            int64
perc_sequences         float64
num_sequences_total      int64
dtype: object